Hi @jniesen 👋 Thanks for reporting this awhile ago and sorry for the delayed triage. There have been a lot of changes in Terraform 0.12 since the alpha releases and I do not believe I'm able to reproduce this any longer with Terraform 0.12.2.

Hopefully equivalent configuration:

```hcl
terraform {
  required_providers {
    aws = "2.15.0"
  }
  required_version = "0.12.2"
}

provider "aws" {
  region = "us-east-2"
}

resource "aws_route53_zone" "root" {
  name = "notexample.com."
}

resource "aws_route53_zone" "sub" {
  count = 1
  name  = "sub.${aws_route53_zone.root.name}"
}

resource "aws_route53_record" "sub-ns" {
  count = 1

  allow_overwrite = true
  name            = aws_route53_zone.sub.0.name
  records         = aws_route53_zone.sub.0.name_servers
  ttl             = 30
  type            = "NS"
  zone_id         = aws_route53_zone.root.zone_id
}

```

Successful apply:

```console
$ terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.sub-ns[0] will be created
  + resource "aws_route53_record" "sub-ns" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "sub.notexample.com"
      + records         = (known after apply)
      + ttl             = 30
      + type            = "NS"
      + zone_id         = (known after apply)
    }

  # aws_route53_zone.root will be created
  + resource "aws_route53_zone" "root" {
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "notexample.com."
      + name_servers  = (known after apply)
      + vpc_id        = (known after apply)
      + vpc_region    = (known after apply)
      + zone_id       = (known after apply)
    }

  # aws_route53_zone.sub[0] will be created
  + resource "aws_route53_zone" "sub" {
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "sub.notexample.com."
      + name_servers  = (known after apply)
      + vpc_id        = (known after apply)
      + vpc_region    = (known after apply)
      + zone_id       = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_route53_zone.root: Creating...
aws_route53_zone.root: Still creating... [10s elapsed]
aws_route53_zone.root: Still creating... [20s elapsed]
aws_route53_zone.root: Still creating... [30s elapsed]
aws_route53_zone.root: Creation complete after 33s [id=Z1TJKOFWPFMILM]
aws_route53_zone.sub[0]: Creating...
aws_route53_zone.sub[0]: Still creating... [10s elapsed]
aws_route53_zone.sub[0]: Still creating... [20s elapsed]
aws_route53_zone.sub[0]: Still creating... [30s elapsed]
aws_route53_zone.sub[0]: Creation complete after 33s [id=ZS77EB1SXUWOW]
aws_route53_record.sub-ns[0]: Creating...
aws_route53_record.sub-ns[0]: Still creating... [10s elapsed]
aws_route53_record.sub-ns[0]: Still creating... [20s elapsed]
aws_route53_record.sub-ns[0]: Still creating... [30s elapsed]
aws_route53_record.sub-ns[0]: Creation complete after 35s [id=Z1TJKOFWPFMILM_sub.notexample.com._NS]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
```

Notably, the `terraform apply` output has this previously missing line from your initial report, which is a likely indicator that Terraform properly handled the unknown value propagation:

```
      + records         = (known after apply)
```

If you are still having trouble with Terraform 0.12.2, please do write back with a reproducing configuration and we can take a further look. Thanks.